{
  "backend/main.mo": "Main Motoko actor defining the BharatSMM backend with services, orders, balances, and user profiles; includes seeded SMM service catalog, order management, and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features on the Add Funds page: displaying a copyable UPI ID and replacing the QR code image with a PhonePe QR code.",
  "frontend-file-summaries.txt": "JSON map of short summaries for all frontend source files, describing the purpose of each component, page, hook, and config file in the BharatSMM frontend.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, brand, sidebar, and chart colors.",
  "frontend/index.html": "HTML shell for the BharatSMM React app with dark mode class, favicon, SEO meta tags, and Open Graph/Twitter Card metadata.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with all page routes, QueryClient, ThemeProvider, auth gating via Internet Identity, and profile setup modal for new users.",
  "frontend/src/components/Layout.tsx": "Persistent sidebar layout component with BharatSMM logo, navigation links, conditional admin panel link, sign-out button, and a responsive mobile menu toggle.",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a colored pill badge for a given order status value, mapping each status (pending, processing, completed, etc.) to a distinct color scheme.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a user's name and email to set up their BharatSMM profile, using the `useSaveCallerUserProfile` mutation and displaying toast notifications on success or failure.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, reinitializing it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile, services, orders, balance, and top-up operations, each wiring the actor from `useActor` to the appropriate canister calls.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Google Fonts (Space Grotesk and Inter), and defines a dark navy/charcoal design system with CSS custom properties for colors, brand tokens, and utility component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/pages/AddFunds.tsx": "A page component for topping up the user's wallet via UPI, displaying the current balance, a PhonePe QR code, preset amount buttons, and a form that submits a top-up request through the `useInitiateTopUp` mutation.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for managing service prices, updating order statuses, and adding balance to user accounts. Renders an access-denied screen for non-admins.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page displaying account stats (balance, total/in-progress/completed orders) and a table of the 5 most recent orders.",
  "frontend/src/pages/LoginPage.tsx": "Public landing/login page showcasing BharatSMM features and a login button that triggers Internet Identity authentication.",
  "frontend/src/pages/NewOrder.tsx": "Order placement page where users select a social media service category and specific service, enter a link and quantity, and submit an order with balance validation.",
  "frontend/src/pages/Orders.tsx": "Paginated orders list page for the authenticated user, with search filtering by service name, link, or order ID and a responsive table showing order details and status.",
  "frontend/src/pages/Profile.tsx": "React page for viewing and editing the logged-in user's profile (name, email), with principal ID display and copy functionality, backed by TanStack Query hooks.",
  "frontend/src/pages/Services.tsx": "React page that lists all available social media marketing services with category filter buttons and a search input, grouping results by category with color-coded badges.",
  "frontend/src/utils/orderCalculations.ts": "Utility functions for calculating order totals from price-per-1000 and quantity, and formatting numbers as INR currency strings or bigint balances.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with custom colors (brand, navy scale), display/mono font families, border radius tokens, and fade-in animation.",
  "project_state.json": "Project state snapshot for the BharatSMM app (version 13), recording implemented features, architectural notes, and requirements including the multi-page frontend, visual theme, admin dashboard, and TanStack Query hooks."
}