{
  "backend/main.mo": "Main Motoko actor for BharatSMM defining Service, SmmOrder, and OrderStatus types, seeding social media services, and managing orders, balances, and user profiles with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming high-confidence deployment of the complete BharatSMM application, listing all relevant frontend and backend files and component dependencies.",
  "frontend-file-summaries.txt": "JSON map of short descriptions for every frontend source file, serving as a reference summary of each file's purpose in the BharatSMM project.",
  "frontend/index.css": "Global Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "HTML shell for the BharatSMM React app with dark mode class, favicon, SEO meta tags, and Open Graph/Twitter Card metadata.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with all app routes, QueryClient, ThemeProvider, auth gating via Internet Identity, and profile setup modal for new users.",
  "frontend/src/components/Layout.tsx": "Persistent sidebar layout component with navigation links, conditional admin panel link, sign-out button, and a responsive mobile menu toggle.",
  "frontend/src/components/OrderStatusBadge.tsx": "Pill badge component that maps each order status enum value (pending, processing, completed, etc.) to a color-coded styled span.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a new user's name and email, then saves their profile via the `useSaveCallerUserProfile` mutation with loading and error feedback.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage Internet Identity authentication state (login, logout, identity persistence) via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all TanStack Query hooks for the app, covering user profile, services, orders, balance, and top-up operations against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/component/utility layers, imports Google Fonts, and sets up CSS custom properties for a dark navy theme with brand colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/AddFunds.tsx": "A page that displays the user's current wallet balance, a UPI QR code for payment, and a form with preset amount buttons to submit a top-up request.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for managing service prices, updating order statuses, and adding balance to user accounts. Renders an access-denied screen for non-admins.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page displaying account stats (balance, total/in-progress/completed orders) and a table of the 5 most recent orders.",
  "frontend/src/pages/LoginPage.tsx": "Public login page showcasing BharatSMM features and a login button that triggers Internet Identity authentication.",
  "frontend/src/pages/NewOrder.tsx": "Order placement page where users select a service category and specific service, enter a link and quantity, and submit an order with real-time cost calculation and balance validation.",
  "frontend/src/pages/Orders.tsx": "Paginated orders list page for the authenticated user, with search filtering by service name, link, or order ID, and a responsive table showing order details and status badges.",
  "frontend/src/pages/Profile.tsx": "React page for viewing and editing the logged-in user's profile (name, email), with principal ID display and copy functionality, using TanStack Query hooks for data fetching and saving.",
  "frontend/src/pages/Services.tsx": "React page that lists all available social media marketing services with search and category filter controls, grouping results by platform category with color-coded badges.",
  "frontend/src/utils/orderCalculations.ts": "Utility functions for calculating order totals from price-per-1000 and quantity, and formatting numbers as INR currency strings or bigint balances.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the BharatSMM design system: dark navy/brand color palette, Inter/Space Grotesk/JetBrains Mono font families, custom border radii, box shadows, and fade-in animation.",
  "project_state.json": "Project state tracking file (version 11) describing the BharatSMM SMM panel app's existing features, architectural notes, and current build goals including an admin dashboard for managing top-up requests and orders."
}