{
  "backend/main.mo": "Main Motoko actor defining the BharatSMM backend with services, orders, balances, and user profiles, including seeded service data and mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping two features — `useAddBalanceToUser` hook and Admin Dashboard 'Add Balance' section — to their respective files and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for every frontend source file, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark themes used throughout the BharatSMM UI.",
  "frontend/index.html": "HTML entry point with BharatSMM title, meta/Open Graph/Twitter Card tags, favicon, and dark mode class.",
  "frontend/src/App.tsx": "Root React app wiring TanStack Router, QueryClient, ThemeProvider, all page routes, auth gating, and the profile setup modal.",
  "frontend/src/components/Layout.tsx": "Persistent sidebar layout component with navigation links, conditional admin link, sign-out handler, and a caffeine.ai footer.",
  "frontend/src/components/OrderStatusBadge.tsx": "Small badge component that maps each order status enum value to a color-coded pill with a human-readable label.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a user's name and email to set up their BharatSMM profile, using the `useSaveCallerUserProfile` mutation and displaying toast notifications on success or failure.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage Internet Identity authentication via `AuthClient`, exposing login/logout functions and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile, services, orders, balance, and top-up operations, each wired to the ICP actor from `useActor`.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind, imports Google Fonts (Space Grotesk and Inter), and defines CSS custom properties for a dark navy/charcoal theme with brand orange accent colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/AddFunds.tsx": "A page that allows users to top up their BharatSMM wallet by entering an amount and paying via UPI, displaying a QR code, preset amount buttons, current balance, and submitting a top-up request via the `useInitiateTopUp` mutation.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page with tabs for managing service prices, updating order statuses, and adding balance to users, with access control enforced via useIsAdmin hook.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page displaying account stats (balance, total/in-progress/completed orders) and a recent orders table with links to other sections.",
  "frontend/src/pages/LoginPage.tsx": "Public login page showcasing BharatSMM features and a login button that triggers Internet Identity authentication.",
  "frontend/src/pages/NewOrder.tsx": "Order placement page where users select a service category and specific service, enter a link and quantity, and submit an order with real-time cost calculation and balance validation.",
  "frontend/src/pages/Orders.tsx": "Paginated orders list page with search filtering by service name, link, or order ID, displaying order details and status badges in a table.",
  "frontend/src/pages/Profile.tsx": "React page for viewing and editing the logged-in user's profile (name, email), with principal ID display and copy functionality using Internet Identity.",
  "frontend/src/pages/Services.tsx": "React page that lists all available social media marketing services with search and category filter, grouped by platform category with color-coded badges.",
  "frontend/src/utils/orderCalculations.ts": "Utility functions for calculating order totals from price-per-1000 and quantity, and formatting amounts as INR currency strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (brand, navy scale, semantic tokens), fonts (Inter, Space Grotesk, JetBrains Mono), border radii, shadows, and animations for the BharatSMM dark theme.",
  "project_state.json": "Project state tracking file (version 15) describing the BharatSMM SMM panel app's existing features, architectural notes, and build requirements including frontend pages and admin dashboard functionality."
}