{
  "backend/main.mo": "Motoko actor defining the BharatSMM backend with Service, SmmOrder, and OrderStatus types, seeded service catalog data, and state maps for services, orders, balances, and user profiles with authorization mixin.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features (multi-page React frontend and BharatSMM visual theme) to their source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, serving as a reference index for the BharatSMM frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark color themes used by shadcn-ui components.",
  "frontend/index.html": "HTML entry point for the BharatSMM app with title, meta description, Google Fonts preconnect, and the root div mounting the React app.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with all page routes, guards unauthenticated users to LoginPage, renders the Layout with Outlet for authenticated users, and shows ProfileSetupModal for new users.",
  "frontend/src/components/Layout.tsx": "Persistent sidebar layout component with BharatSMM logo, navigation links, active-route highlighting, mobile hamburger menu, and login/logout button showing the user's principal.",
  "frontend/src/components/OrderStatusBadge.tsx": "Reusable badge component that maps order status enum values to color-coded pill badges with labels for pending, processing, completed, canceled, failed, and refunded states.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a user's name and email to set up their profile on first login, using the `useSaveCallerUserProfile` mutation hook to persist the data.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage Internet Identity authentication state, including login, logout, and persisting identity across page reloads via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching and mutating backend data including services, user balance, orders, and user profile, all wired through the `useActor` and `useInternetIdentity` hooks.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with OKLCH-based design tokens for light and dark modes, and defines utility classes for brand gradients and glass-card effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/pages/AddFunds.tsx": "A page component that displays the user's current balance and a form with preset and custom amount options to submit a fund top-up request, which is marked as pending admin approval upon submission.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing account balance, order stats (pending/processing/completed), and quick-action buttons; requires user login via Internet Identity.",
  "frontend/src/pages/LoginPage.tsx": "Login landing page displaying BharatSMM branding and feature highlights, with an Internet Identity login button.",
  "frontend/src/pages/NewOrder.tsx": "Order placement form allowing authenticated users to filter services by category, select a service, enter a link and quantity, and submit an SMM order.",
  "frontend/src/pages/Orders.tsx": "Paginated, searchable table of the authenticated user's SMM orders, showing service name, link, status badge, date, and cost.",
  "frontend/src/pages/Profile.tsx": "Profile page where authenticated users can view and edit their name and email, and copy their Internet Identity principal ID.",
  "frontend/src/pages/Services.tsx": "Services catalog page with search and category filter tabs, rendering cards for each SMM service with pricing, min/max order info, and platform badges.",
  "frontend/src/utils/orderCalculations.ts": "Provides utility functions for calculating order totals from price-per-1000 and quantity, and formatting numeric or bigint values as INR currency strings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the BharatSMM frontend, defining a dark navy/orange-red theme with custom colors, fonts, shadows, border radii, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks the overall project state for the bharatsmm SMM panel app, including schema version, existing features, pending feature requests, architectural notes, and image requirements."
}