{
  "kind": "build_request",
  "title": "Add balance top-up capability for admin to credit user accounts",
  "projectName": "BharatSMM",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Add a backend Motoko function `addBalanceToUser(userId: Principal, amount: Nat) → Result` (admin-only) that allows the admin to directly credit a specified amount (in paise/smallest unit) to any user's balance. The function must reject calls from non-admin principals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Adim dedo"
        ]
      },
      "acceptanceCriteria": [
        "Function `addBalanceToUser` exists in `backend/main.mo`",
        "Only the admin principal can call it; non-admin callers receive an error result",
        "On success, the target user's balance is increased by the specified amount",
        "Returns a Result type indicating success or failure"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a TanStack Query mutation hook `useAddBalanceToUser` in `frontend/src/hooks/useQueries.ts` that calls the backend `addBalanceToUser` function. On success, invalidate the relevant balance/user queries. Follow the same pattern as existing mutation hooks in that file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Adim dedo"
        ]
      },
      "acceptanceCriteria": [
        "`useAddBalanceToUser` hook is exported from `frontend/src/hooks/useQueries.ts`",
        "Hook accepts userId (Principal) and amount (Nat) as mutation variables",
        "On success, related queries are invalidated so balances refresh",
        "Follows the same pattern as existing mutation hooks in the file"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add an 'Add Balance' section or tab to the existing Admin Dashboard page (`frontend/src/pages/AdminDashboard.tsx`). It must include a principal input field, an amount input field (in INR), and a 'Add Balance' submit button. On submit, call `useAddBalanceToUser` and display a success or error toast. Apply the existing BharatSMM dark navy/orange-red theme consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Adim dedo"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard has an 'Add Balance' section/tab",
        "Section includes a principal text input and an INR amount number input",
        "Clicking 'Add Balance' calls the mutation and shows a success toast on success",
        "Error cases show an error toast",
        "UI matches the existing BharatSMM dark navy/orange-red theme"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths",
    "Admin-only backend functions must reject non-admin callers",
    "All Motoko logic must remain in the single actor file backend/main.mo"
  ],
  "nonGoals": [
    "Changing existing top-up request approval flow",
    "Adding any new pages beyond the Admin Dashboard modification",
    "Modifying service catalog or order management features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}