{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Publish BharatSMM — Final Live Deployment",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Deploy the complete BharatSMM application with all existing features as the live production version",
      "acceptanceCriteria": [
        "The app is deployed and accessible at its live URL.",
        "All existing pages (Dashboard, New Order, Orders, Services, Add Funds, Profile, Admin Panel) are reachable and functional.",
        "The Admin Panel is accessible only to the admin principal.",
        "The dark navy/orange-red visual theme is consistently applied across all pages.",
        "The sidebar renders the BharatSMM logo and all navigation links including the conditional Admin Panel entry.",
        "The Add Funds page shows the UPI QR code and accepts deposits as low as ₹1.",
        "Service price editing works from the Admin Panel's Service Prices tab.",
        "All backend functions (orders, balances, top-up requests, admin operations) are live and operational."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Verify the BharatSMM logo at frontend/public/assets/generated/bharatsmm-logo.dim_256x256.png is correctly referenced in the sidebar. Ensure the admin-only navigation link with ShieldCheck icon is conditionally rendered based on the isCallerAdmin query result. Confirm all navigation links (Dashboard, New Order, Orders, Services, Add Funds, Profile, Admin Panel) are present and functional."
        },
        {
          "path": "frontend/src/pages/AddFunds.tsx",
          "operation": "modify",
          "description": "Verify the UPI QR code image at frontend/public/assets/generated/bharatsmm-payment-qr.dim_400x400.png is correctly displayed. Ensure the minimum top-up amount of ₹1 is enforced in the validation logic and that the initiateTopUp mutation is working correctly with the backend."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Verify admin access guard correctly uses the isCallerAdmin query to show AccessDeniedScreen for non-admin users. Ensure all three tabs (Service Prices, Order Status, User Balance) are functional with their respective mutation hooks (useUpdateServicePrice, useUpdateOrderStatus, useAddBalance). Confirm the component follows the authorization component's guidance for admin-only access control."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Verify the user dashboard displays current balance using the useGetBalance query, total order count, and order status breakdown (pending, processing, completed). Ensure navigation shortcuts to New Order and Orders pages are working. Confirm the dark navy/orange-red theme is applied correctly."
        },
        {
          "path": "frontend/src/pages/NewOrder.tsx",
          "operation": "modify",
          "description": "Verify service filtering by category works correctly using the useListServices query. Ensure order cost calculation using the orderCalculations utility is accurate. Confirm the usePlaceOrder mutation successfully submits orders and deducts the balance. Verify the dark navy/orange-red theme styling is consistent."
        },
        {
          "path": "frontend/src/pages/Orders.tsx",
          "operation": "modify",
          "description": "Verify the paginated order history correctly displays orders using the useListOrdersByUser query. Ensure search filtering by service name, link, or order ID works properly. Confirm OrderStatusBadge components render correctly for all order statuses. Verify the theme is consistent with the rest of the application."
        },
        {
          "path": "frontend/src/pages/Services.tsx",
          "operation": "modify",
          "description": "Verify the searchable, filterable service catalog correctly displays all services grouped by social media category using the useListServices query. Ensure each service card shows price per 1000, min/max order limits, and category badge. Confirm the dark navy/orange-red theme styling is applied."
        },
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Verify the user profile page correctly displays and allows editing of name and email using useGetCallerUserProfile and useSaveCallerUserProfile hooks. Ensure the Internet Identity principal ID is shown with a functional copy button. Confirm the theme is consistent."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify TanStack Router is configured with all required routes (Dashboard, New Order, Orders, Services, Add Funds, Profile, Admin Panel). Ensure authentication gating using the useInternetIdentity hook redirects unauthenticated users to the LoginPage. Confirm ProfileSetupModal is shown for new users based on the useGetCallerUserProfile query result. Verify the authorization component's guidance is followed for proper authentication flow."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify the OKLCH-based CSS custom properties for the dark navy/orange-red theme are correctly defined and applied globally. Ensure Tailwind CSS is properly imported and configured. Confirm the brand gradient and glass utility classes are available for use across all pages."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the HTML shell has the correct title 'BharatSMM' and meta description for production deployment. Ensure the root div with id='root' is present for React mounting. Confirm all necessary meta tags for SEO and social sharing are included."
        }
      ]
    }
  ]
}