{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Add Funds page with UPI ID and PhonePe QR code",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Display UPI ID '8825245372-l3c6@ibl' prominently in the Add Funds page Scan & Pay section with a copyable text field and 'Copy UPI ID' button",
      "acceptanceCriteria": [
        "UPI ID '8825245372-l3c6@ibl' is displayed visibly in the Add Funds page Scan & Pay section",
        "A 'Copy UPI ID' button or similar affordance allows users to copy the UPI ID to clipboard",
        "Instructional text tells users to pay using any UPI app to this UPI ID",
        "The UPI ID display is styled consistently with the existing dark navy/orange-red BharatSMM theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddFunds.tsx",
          "operation": "modify",
          "description": "Add a UPI ID display section in the 'Scan & Pay' area showing '8825245372-l3c6@ibl' as a prominently displayed, copyable text field. Include a 'Copy UPI ID' button that copies the UPI ID to the user's clipboard when clicked, with visual feedback (e.g., a toast notification or button text change to 'Copied!'). Add instructional text above or near the UPI ID stating 'Pay to this UPI ID using any UPI app (PhonePe, Google Pay, Paytm, etc.)'. Style the UPI ID section using Tailwind classes consistent with the existing BharatSMM dark navy background and orange-red accent colors from the theme defined in frontend/src/index.css and frontend/tailwind.config.js."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Replace existing QR code with the newly generated PhonePe QR code image and display account holder name 'Mr Sandeep Kumar'",
      "acceptanceCriteria": [
        "The PhonePe QR code image is displayed prominently in the Scan & Pay section of the Add Funds page",
        "The label 'Scan with PhonePe or any UPI app' appears above or alongside the QR code",
        "Account holder name 'Mr Sandeep Kumar' is shown beneath the QR code",
        "The existing old QR code image reference is replaced with the new one",
        "QR code section is styled consistently with the BharatSMM dark navy/orange-red theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddFunds.tsx",
          "operation": "modify",
          "description": "Replace the existing QR code image reference in the 'Scan & Pay' section with the newly generated PhonePe QR code located at frontend/public/assets/generated/bharatsmm-phonepe-qr.dim_400x600.png. Display the QR code image prominently above the UPI ID section (from REQ-19). Add a label 'Scan with PhonePe or any UPI app' immediately above or next to the QR code. Below the QR code, display the account holder name 'Mr Sandeep Kumar' in a readable font size. Ensure the QR code section uses Tailwind classes that align with the BharatSMM dark navy/orange-red theme. Remove any references to the old QR code image path."
        }
      ]
    }
  ]
}