{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add balance top-up capability for admin to credit user accounts",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Add a TanStack Query mutation hook `useAddBalanceToUser` that calls the backend `addBalanceToUser` function and invalidates balance/user queries on success",
      "acceptanceCriteria": [
        "`useAddBalanceToUser` hook is exported from `frontend/src/hooks/useQueries.ts`",
        "Hook accepts userId (Principal) and amount (Nat) as mutation variables",
        "On success, related queries are invalidated so balances refresh",
        "Follows the same pattern as existing mutation hooks in the file"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add `useAddBalanceToUser` mutation hook that accepts userId (Principal) and amount (bigint) as variables. Call `actor.addBalanceToUser(userId, amount)` in the mutation function. On success, invalidate the 'balance' query key to refresh user balance data. Follow the existing mutation pattern used by `useInitiateTopUp` and `useSaveCallerUserProfile` hooks in this file."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add an 'Add Balance' section to the Admin Dashboard page with principal input, INR amount input, and submit button that calls the mutation and shows toast feedback",
      "acceptanceCriteria": [
        "Admin Dashboard has an 'Add Balance' section/tab",
        "Section includes a principal text input and an INR amount number input",
        "Clicking 'Add Balance' calls the mutation and shows a success toast on success",
        "Error cases show an error toast",
        "UI matches the existing BharatSMM dark navy/orange-red theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Add Balance' tab to the existing Tabs component alongside 'Service Prices' and 'Order Status'. In the tab content, create a form with two input fields: one text input for the user's principal ID (with validation) and one number input for the amount in INR. Include a submit button labeled 'Add Balance'. Wire the form submission to call the `useAddBalanceToUser` mutation hook from `frontend/src/hooks/useQueries.ts`, converting the INR amount to paise (multiply by 100) before passing to the backend. Display success toast on successful balance addition and error toast on failure. Apply the existing dark navy/orange-red theme styling consistent with other tabs and forms in this page."
        }
      ]
    }
  ]
}